Revit 2023 API
EnergyDataSettings.SetCreateAnalyticalModel Method
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyModel' property instead.")]
public void SetCreateAnalyticalModel(
	bool createAnalyticalModel
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyModel' property instead.")> _
Public Sub SetCreateAnalyticalModel ( _
	createAnalyticalModel As Boolean _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyModel' property instead.")]
public:
void SetCreateAnalyticalModel(
	bool createAnalyticalModel
)
Parameters
createAnalyticalModel
Type: System.Boolean
 True to enable the Energy Analytical Model otherwise.
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace